# Reshape From Facets Failures Properties

Source: https://www.revitapidocs.com/2026/ec4542c4-9e0a-ecf5-6058-10f45853cd53.htm

---

| Reshape From Facets Failures Properties |
| --- |

The BuiltInFailures ReshapeFromFacetsFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ReshapeFromFacetsFailed | Reshape from facets failed. \[Description] |
|  | ReshapeFromFacetsFailedError | Reshape from facets failed. \[Description] |

Top See Also

#### Reference

BuiltInFailures ReshapeFromFacetsFailures Class Autodesk.Revit.DB Namespace